In [3]:
import pandas as pd

In [4]:
 # !pip install ~ 설치 명령

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\asiae_06\appdata\local\programs\python\python38-32\lib\site-packages (1.1.0)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\asiae_06\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\asiae_06\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\asiae_06\appdata\local\programs\python\python38-32\lib\site-packages (from pandas) (1.19.1)
Requirement already satisfied: six>=1.5 in c:\users\asiae_06\appdata\local\programs\python\python38-32\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the 'c:\users\asiae_06\appdata\local\programs\python\python38-32\python.exe -m pip install --upgrade pip' command.

In [6]:
import pandas as pd

In [7]:
seq_data=[10,20,30,40,50]
s1=pd.Series(seq_data)
s1  #값(10,20,30,40,50)이 들어가면 indexing(0,1,2,3,4)이 자동으로 된다

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
s1.values

array([10, 20, 30, 40, 50], dtype=int64)

In [10]:
s2=pd.Series(['a','b','c',1,2,3])   #Series는 vector만 표현함
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [11]:
import numpy as np #numpy는 내장 함수여서 따로 설치할 필요 없다

In [15]:
s3=pd.Series([np.nan,10,30])  #np.nan => 값 없을 때? ;; np를 써서 nan값으로 만들면 실수로 바뀐다.
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [16]:
s3=pd.Series([1,10,30])  #np.nan => 값 없을 때 실수로 바뀐다
s3

0     1
1    10
2    30
dtype: int64

# s=pd.Series(seq_data, index= index_seq)

In [17]:
index_date = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
s4=pd.Series([200, 195, np.nan, 205], index= index_date)  
s4

2018-10-07    200.0
2018-10-08    195.0
2018-10-09      NaN
2018-10-10    205.0
dtype: float64

In [18]:
index_date = ['2018-10-07','2018-10-08','2018-10-09','2018-10-10']
s4=pd.Series([200, 195, 190, 205], index= index_date)  
s4

2018-10-07    200
2018-10-08    195
2018-10-09    190
2018-10-10    205
dtype: int64

In [21]:
s5=pd.Series({'국어':100, '영어':95, '수학': 90}, index= index_date)
s5  
#자동으로 키값이 인덱싱 됨
#딕셔너리는 KEY 값이 인덱스가 되기 때문에
# 딕셔너리에서 인덱싱 index= index_date 설정하면 값이 NaN이 된다.

2018-10-07   NaN
2018-10-08   NaN
2018-10-09   NaN
2018-10-10   NaN
dtype: float64

In [22]:
s5=pd.Series({'국어':100, '영어':95, '수학': 90})
s5  #자동으로 키값이 인덱싱 됨

국어    100
영어     95
수학     90
dtype: int64

In [23]:
s5.name ='과목'

In [25]:
s5

국어    100
영어     95
수학     90
Name: 과목, dtype: int64

In [27]:
s5.index.name = '과목'
s5

과목
국어    100
영어     95
수학     90
Name: 과목, dtype: int64

# pd.date_range(start=None, end=None, periods+None, freq='D') #날짜 자동 생성

In [19]:
pd.date_range(start='2020-01-01', end='2020-01-07', freq='D')

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07'],
              dtype='datetime64[ns]', freq='D')

# DataFrame을 활용한 데이터 생성

In [28]:
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])

In [29]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [30]:
data=np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
data

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [32]:
data=np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]]) # 가로 4줄
index_date=pd.date_range(start='2020-01-01', periods=4) #가로 4줄, 만약 periods=3; 가로 3줄
columns_list= ['A','B','C','D'] #세로 4줄
df=pd.DataFrame(data,index=index_date, columns=columns_list)
df

             A   B   C   D
2020-01-01   1   2   3   4
2020-01-02   5   6   7   8
2020-01-03   9  10  11  12
2020-01-04  13  14  15  16

In [33]:
data=np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]]) # 가로 4줄
index_date=pd.date_range(start='2020-01-01', periods=4) #가로 4줄, 만약 periods=3; 가로 3줄
columns_list= ['A','B','C'] #세로 3줄
df=pd.DataFrame(data,index=index_date, columns=columns_list)
#df=pd.DataFrame(data = data,index=index_date, columns=columns_list)

df

             A   B   C
2020-01-01   1   2   3
2020-01-02   4   5   6
2020-01-03   7   8   9
2020-01-04  10  11  12

In [35]:
df.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04'], dtype='datetime64[ns]', freq='D')

In [39]:
df.loc['2020-01-01']

A    1
B    2
C    3
Name: 2020-01-01 00:00:00, dtype: int32

In [42]:
df1=pd.DataFrame({'연도' :[2011,2012,2013,2014]}) 
#Series는 키 값이 indexing으로 가고  DataFrame은 키 값이 'column'으로 감
df1

     연도
0  2011
1  2012
2  2013
3  2014

In [44]:
s5=pd.Series({'국어':100, '영어':95, '수학': 90})
#Series는 키 값이 indexing으로 가고  DataFrame은 키 값이 'index'로 감

s5  #자동으로 키값이 인덱싱 됨

국어    100
영어     95
수학     90
dtype: int64

In [ ]:
df1.loc()

In [45]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([10,20,30,40])
s1+s2

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [46]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([10,20,30,40,50])
s1-s2

0    -9
1   -18
2   -27
3   -36
4   -45
dtype: int64

In [21]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([10,20,30,40,50])
s1*s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [22]:
s1=pd.Series([1,2,3,4,5])
s2=pd.Series([10,20,30,40,50])
s1/s2

0    0.1
1    0.1
2    0.1
3    0.1
4    0.1
dtype: float64

In [70]:
df1=pd.Series({'A':[1,2,3,4,5], 'B':[10,20,30,40,50]})
df1

A         [1, 2, 3, 4, 5]
B    [10, 20, 30, 40, 50]
dtype: object

In [71]:
df1=pd.DataFrame({'A':[1,2,3,4,5], 'B':[10,20,30,40,50]})
df1

   A   B
0  1  10
1  2  20
2  3  30
3  4  40
4  5  50

In [72]:
df2=pd.DataFrame({'A':[10,20,30,40,50,60], 'B':[100,200,300,400,500,600]})
df2

    A    B
0  10  100
1  20  200
2  30  300
3  40  400
4  50  500
5  60  600

In [73]:
df2[0:2]

    A    B
0  10  100
1  20  200

In [74]:
df2[-4:-2]

    A    B
2  30  300
3  40  400

In [76]:
df3 = df1 + df2
df3

      A      B
0  11.0  110.0
1  22.0  220.0
2  33.0  330.0
3  44.0  440.0
4  55.0  550.0
5   NaN    NaN

In [79]:
df2.loc[1]
df2

    A    B
0  10  100
1  20  200
2  30  300
3  40  400
4  50  500
5  60  600

# df2.head()

In [80]:
df2.tail(5)

    A    B
1  20  200
2  30  300
3  40  400
4  50  500
5  60  600

In [81]:
df3=df1+df2
df3

      A      B
0  11.0  110.0
1  22.0  220.0
2  33.0  330.0
3  44.0  440.0
4  55.0  550.0
5   NaN    NaN

In [82]:
df3.mean(axis=1)    #mean :평균 ,#axis=0 x축(컬럼 기준) sum(axis=0)=세로줄끼리 합, axis=1 y축(인덱스 기준), axis=2 z축

0     60.5
1    121.0
2    181.5
3    242.0
4    302.5
5      NaN
dtype: float64

In [83]:
df3.std() #표준 편차

A     17.392527
B    173.925271
dtype: float64

In [84]:
df3.describe() #한번에 쫙!

               A           B
count   5.000000    5.000000
mean   33.000000  330.000000
std    17.392527  173.925271
min    11.000000  110.000000
25%    22.000000  220.000000
50%    33.000000  330.000000
75%    44.000000  440.000000
max    55.000000  550.000000

# 데이터를 원하는 대로 선택하기

In [85]:
ktx_data ={'경부선':[39,38,37,36,35],
            '호남선':[29,28,27,26,25]}

In [86]:
df_ktx=pd.DataFrame(ktx_data,index=['2011','2012','2013','2014','2015']) # columns:세로줄 ,index:가로줄,  #columns=['경부선','호남선']

In [87]:
df_ktx

      경부선  호남선
2011   39   29
2012   38   28
2013   37   27
2014   36   26
2015   35   25

In [11]:
df_ktx.loc['2011']   #df_ktx.loc('2011')로 하면 에러 뜸 왜냐하면 loc은 함수가 아니기 때문임

경부선    39
호남선    29
Name: 2011, dtype: int64

# Column indexing

In [89]:
#컬럼 '경부선'이 'KEY' 값으로 잡혀있기 때문에 loc가 필요가 없다.
df_ktx['경부선']

2011    39
2012    38
2013    37
2014    36
2015    35
Name: 경부선, dtype: int64

In [90]:
#컬럼 추가하기
df_ktx['경춘선']= 2016

In [91]:
df_ktx

      경부선  호남선   경춘선
2011   39   29  2016
2012   38   28  2016
2013   37   27  2016
2014   36   26  2016
2015   35   25  2016

In [94]:
df_ktx['경춘선']= [3,4,5,6,7] 
#컬럼내 값 지정하기

In [95]:
df_ktx

      경부선  호남선  경춘선
2011   39   29    3
2012   38   28    4
2013   37   27    5
2014   36   26    6
2015   35   25    7

In [101]:
#컬럼 삭제하기
df_ktx.drop(['경춘선'], axis =1)

      경부선  호남선
2011   39   29
2012   38   28
2013   37   27
2014   36   26
2015   35   25

In [104]:
# axis = 이미 0이기 때문에 위처럼 꼭 axis = 썸씽을 누를 필요가 없다. 
df_ktx.drop(['2011'])

      경부선  호남선  경춘선
2012   38   28    4
2013   37   27    5
2014   36   26    6
2015   35   25    7

In [ ]:
df_ktx[:,'경부선':'경춘선']

In [106]:
df_ktx.iloc[:, :-1]  #iloc 은 슬라이싱 만 가능

      경부선  호남선
2011   39   29
2012   38   28
2013   37   27
2014   36   26
2015   35   25

In [109]:
df_ktx.loc['2012':'2014'] # loc 은 str만 먹는다.

      경부선  호남선  경춘선
2012   38   28    4
2013   37   27    5
2014   36   26    6

In [121]:
df_ktx = pd.DataFrame(ktx_data, columns = ['경부선','호남선'])

In [127]:
df_ktx=pd.DataFrame(ktx_data,index=['2011','2012','2013','2014','2015']) # columns:세로줄 ,index:가로줄,  #columns=['경부선','호남선']

In [122]:
ktx_data ={'경부선':[39,38,37,36,35],
            '호남선':[29,28,27,26,25]}

In [131]:
df_ktx['경춘선']= [3,4,5,6,7]

In [132]:
df_ktx

      경부선  호남선  경춘선
2011   39   29    3
2012   38   28    4
2013   37   27    5
2014   36   26    6
2015   35   25    7

In [123]:
ktx_data1 = {'경부선':[1,2,3,4],
            '호남선':[2,4,5,6]}

In [129]:
df_ktx1 = pd.DataFrame(ktx_data1, columns = ['경부선','호남선'])

In [130]:
df_ktx1

   경부선  호남선
0    1    2
1    2    4
2    3    5
3    4    6

In [133]:
df_ktx.sort_values(by ='경부선', ascending = True)

      경부선  호남선  경춘선
2015   35   25    7
2014   36   26    6
2013   37   27    5
2012   38   28    4
2011   39   29    3

In [134]:
df_ktx.sort_values(by ='호남선', ascending = True)

      경부선  호남선  경춘선
2015   35   25    7
2014   36   26    6
2013   37   27    5
2012   38   28    4
2011   39   29    3

# 통계량분석

# 기술통계량

In [135]:
df_ktx.count()

경부선    5
호남선    5
경춘선    5
dtype: int64

In [136]:
df_ktx.min()  #max(),sum(),mean(), median(),

경부선    35
호남선    25
경춘선     3
dtype: int64

In [137]:
df_ktx.quantile()

경부선    37.0
호남선    27.0
경춘선     5.0
Name: 0.5, dtype: float64

In [138]:
df_ktx.quantile

<bound method DataFrame.quantile of       경부선  호남선  경춘선
2011   39   29    3
2012   38   28    4
2013   37   27    5
2014   36   26    6
2015   35   25    7>

In [139]:
df_ktx.describe

<bound method NDFrame.describe of       경부선  호남선  경춘선
2011   39   29    3
2012   38   28    4
2013   37   27    5
2014   36   26    6
2015   35   25    7>

In [140]:
df_ktx.describe()

             경부선        호남선       경춘선
count   5.000000   5.000000  5.000000
mean   37.000000  27.000000  5.000000
std     1.581139   1.581139  1.581139
min    35.000000  25.000000  3.000000
25%    36.000000  26.000000  4.000000
50%    37.000000  27.000000  5.000000
75%    38.000000  28.000000  6.000000
max    39.000000  29.000000  7.000000

In [142]:
df_ktx.corr()  #상관관계

     경부선  호남선  경춘선
경부선  1.0  1.0 -1.0
호남선  1.0  1.0 -1.0
경춘선 -1.0 -1.0  1.0

In [145]:
df_ktx.var() #Variance 분산

경부선    2.5
호남선    2.5
경춘선    2.5
dtype: float64

In [146]:
df_ktx.cov() #Covariance 공분산

     경부선  호남선  경춘선
경부선  2.5  2.5 -2.5
호남선  2.5  2.5 -2.5
경춘선 -2.5 -2.5  2.5